documentation cleaup
